Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་པ་བཅུའོ། །
en: These are a bodhisattva’s ten types of knowledge.

source: དེ་ལ་སྡུག་བསྔལ་ཤེས་པ་གང་ཞེ་ན།
en: “What is knowledge of suffering?

source: གང་སྡུག་བསྔལ་ལ་སྡུག་བསྔལ་དུ་ཤེས་པ། སྡུག་བསྔལ་ལ་ཀུན་འབྱུང་བར་ཤེས་པ། སྡུག་བསྔལ་ལ་འགོག་པར་ཤེས་པ། སྡུག་བསྔལ་ལ་ལམ་དུ་ཤེས་པའོ། །
en: It is to know suffering in terms of suffering, suffering in terms of its origin, suffering in terms of its cessation, and suffering in terms of the path.

source: གཞན་ཡང་སྡུག་བསྔལ་སྟོང་པར་ཤེས་པ། སྡུག་བསྔལ་མཚན་མ་མེད་པར་ཤེས་པ། སྡུག་བསྔལ་སྨོན་པ་མེད་པར་ཤེས་པ།
en: Additionally, it is to know suffering as empty, suffering as signless, suffering as wishless, and suffering as dependently originated.

source: སྡུག་བསྔལ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བར་ཤེས་པ་འཇིག་རྟེན་སྐྱེ་བ་འདི་སྡུག་བསྔལ་བར་ཤེས་པ་ནི་སྡུག་བསྔལ་ཤེས་པའོ། །
en: It is to know that this birth in the world is suffering.

source: གཞན་ཡང་མ་རིག་པ་ཤེས་པ། སྲེད་པ་ཤེས་པ།
en: Knowing ignorance, craving, and grasping is to know suffering.

source: ལེན་པ་ཤེས་པ་ནི་སྡུག་བསྔལ་ཤེས་པ་སྟེ་འདི་ནི་སྡུག་བསྔལ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is what is known as knowledge of suffering.

source: དེ་ལ་ཀུན་འབྱུང་བ་ཤེས་པ་གང་ཞེ་ན།
en: “What is knowledge of the origin?

source: གང་གིས་སྡུག་བསྔལ་དེ་ཀུན་འབྱུང་བར་འགྱུར་བ་དེ་ཤེས་པ་ནི་ཀུན་འབྱུང་བ་ཤེས་པའོ། །
en: Knowing that through which suffering originates is knowledge of the origin.

source: ཀུན་འབྱུང་བ་དེ་སྡུག་བསྔལ་ཉིད་དུ་ཤེས་པ་ནི་ཀུན་འབྱུང་བ་ཤེས་པའོ། །
en: Knowing that origin to be suffering itself is knowledge of the origin.

source: གཞན་ཡང་སྲེད་པ་ཤེས་པ་ནི་ཀུན་འབྱུང་བ་ཤེས་པ་ཡིན་ཏེ།
en: Knowing craving is also knowledge of the origin.

source: འདི་ནི་ཀུན་འབྱུང་བ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is what is known as knowledge of the origin.

source: དེ་ལ་འགོག་པ་ཤེས་པ་གང་ཞེ་ན།
en: “What is knowledge of cessation?

source: གང་སྔོན་གྱི་མཐར་མི་འཕོ་བར་ཤེས་པ། ཕྱི་མའི་མཐར་མི་འབྱུང་བར་ཤེས་པ། དབུས་ལ་མི་གནས་པར་ཤེས་པའོ། །
en: It is knowing that which does not pass away in the previous life, that which does not arise in the next life, and that which is not present in between.

source: གཞན་ཡང་གང་ལ་འདས་པའི་ཆོས་འགགས་པ་མ་ཡིན་པ་དང་མ་འོངས་པ་དང་།
en: Additionally, it is knowing that phenomena from the past are not subject to cessation, and that phenomena that arise in the future and present also are not subject to cessation.

source: ད་ལྟར་བྱུང་བའི་ཆོས་འགགས་པ་མ་ཡིན་པར་ཤེས་པ་འདི་ནི་འགོག་པ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is what is known as knowledge of cessation.

source: དེ་ལ་ལམ་ཤེས་པ་གང་ཞེ་ན།
en: “What is knowledge of the path?

source: གང་སྡུག་བསྔལ་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་དང་། འགོག་པ་ཤེས་པ་ལ་ཚོལ་བའི་ཤེས་པ་དང་།
en: It is the knowledge that seeks out the knowledge of suffering, the knowledge of its origin, and the knowledge of its cessation, and is the knowledge that brings about attainment.

source: ཐོབ་པར་བྱེད་པའི་ཤེས་པ་འདི་ནི་ལམ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is what is known as knowledge of the path.

source: དེ་ལ་སྡུག་བསྔལ་ལ་ཆོས་ཤེས་ཤིང་ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་ལམ་ལ་ཆོས་ཤེས་པ་གང་ཞེ་ན།
en: “What is knowledge of the phenomena associated with suffering, its origin, its cessation, and the path?

source: དེ་འདི་སྙམ་དུ་སེམས་ཏེ། སྡུག་བསྔལ་གང་ཡིན་པ་དང་། ཀུན་འབྱུང་བ་གང་ཡིན་པ་དང་། འགོག་པ་གང་ཡིན་པ་དང་། ལམ་གང་ཡིན་པ་དེ་དག་ནི་ཆོས་ཙམ་དུ་ཟད་དོ་སྙམ་པ་འདི་ནི་སྡུག་བསྔལ་ལ་ཆོས་ཤེས་པ་དང་།
en: A bodhisattva thinks, ‘Anything associated with suffering, its origin, its cessation of suffering, and the path is nothing more than a conventional phenomenon.’

source: ཀུན་འབྱུང་བ་དང་འགོག་པ་དང་ལམ་ལ་ཆོས་ཤེས་པ་ཞེས་བྱའོ། །
en: This is what is known as knowledge of the phenomena associated with suffering; this is what is known as knowledge of the phenomena associated with its origin, its cessation, and the path.

source: དེ་ལ་ཕུང་པོ་རྣམས་ཤེས་པ་ནི་གང་ཕུང་པོ་རྣམས་ལ་སྒྱུ་མ་དང་རྨི་ལམ་ལྟ་བུར་ཤེས་པ།
en: “What is knowledge of the aggregates? It is knowing the aggregates to be like an illusion and a dream.

source: གོང་བུར་ཤེས་པ། ཕུང་པོར་ཤེས་པ།
en: It is knowing them as conglomerates, as aggregations, and knowing them to be something amassed.

source: བརྩེགས་པར་ཤེས་པ་འདི་ནི་ཕུང་པོ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is known as knowledge of the aggregates.

source: གཞན་ཡང་གཟུགས་ཀྱི་ཕུང་པོ་ལ་དབུ་བ་རྡོས་པ་ལྟ་བུར་ཤེས་པ་དང་། ཚོར་བའི་ཕུང་པོ་ལ་ཆུའི་ཆུ་བུར་ལྟ་བུར་ཤེས་པ་དང་། འདུ་ཤེས་ཀྱི་ཕུང་པོ་ལ་སྨིག་རྒྱུ་བ་ལྟ་བུར་ཤེས་པ་དང་། འདུ་བྱེད་ཀྱི་ཕུང་པོ་ལ་ཆུ་ཤིང་ལྟ་བུར་ཤེས་པ་དང་། རྣམ་པར་ཤེས་པའི་ཕུང་པོ་ལ་སྒྱུ་མ་ལྟ་བུར་ཤེས་པ་འདི་ནི་ཕུང་པོ་ཤེས་པ་ཞེས་བྱའོ། །
en: Furthermore, the aggregate of form is known to be like foam, the aggregate of sensation is known to be like a water bubble, the aggregate of perception is known to be like a mirage, the aggregate of formations is known to be like a plantain tree, and the aggregate of consciousness is known to be like an illusion.

source: དེ་ལ་ཁམས་ཤེས་པ་གང་ཞེ་ན།
en: This is known as knowledge of the aggregates. “What is knowledge of the elements?

source: སའི་ཁམས་ནི་ཆོས་ཀྱི་དབྱིངས་ཏེ་ཆོས་ཀྱི་དབྱིངས་སྲ་བ་ནི་མ་ཡིན་ནོ། །
en: The element of earth is the expanse of phenomena, and the expanse of phenomena is not solid.

source: དེ་བཞིན་དུ་ཆུའི་ཁམས་ནི་ཆོས་ཀྱི་དབྱིངས་ཏེ། ཆོས་ཀྱི་དབྱིངས་གཤེར་བ་ནི་མ་ཡིན་ནོ། །
en: Similarly, the element of water is the expanse of phenomena, and the expanse of phenomena is not wet.

source: མེའི་ཁམས་ནི་ཆོས་ཀྱི་དབྱིངས་ཏེ། ཆོས་ཀྱི་དབྱིངས་ཚ་བ་ནི་མ་ཡིན་ནོ། །
en: The element of fire is the expanse of phenomena, and the expanse of phenomena is not hot.

source: རླུང་གི་ཁམས་ནི་ཆོས་ཀྱི་དབྱིངས་ཏེ། ཆོས་ཀྱི་དབྱིངས་གཡོ་བ་ནི་མ་ཡིན་ཏེ།
en: The element of wind is the expanse of phenomena, and the expanse of phenomena does not move.

source: གང་དེ་ལྟར་ཤེས་པ་འདི་ནི་ཁམས་ཤེས་པ་ཞེས་བྱའོ། །
en: This kind of knowledge is known as knowledge of the elements.

source: གཞན་ཡང་ཕྲ་བ་ཤེས་པ་དང་། རགས་པ་ཤེས་པ་དང་། ཆུང་ངུ་ཤེས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རྩ་བ་ཤེས་པ་ནི། ཁམས་ཤེས་པ་ཞེས་བྱའོ། །
en: “Furthermore, knowledge of the subtle, knowledge of the coarse, knowledge of small, and knowledge of the root of all phenomena are known as knowledge of the elements.

source: གཞན་ཡང་སྡུག་བསྔལ་ཤེས་པ་དང་། ཀུན་འབྱུང་བ་ཤེས་པ་དང་། འགོག་པ་ཤེས་པ་དང་ལམ་ཤེས་པ་འདི་ནི་ཁམས་ཤེས་པ་ཞེས་བྱའོ། །
en: “Furthermore, knowledge of suffering, knowledge of its origin, knowledge of its cessation, and knowledge of the path are known as knowledge of the elements.

source: གཞན་ཡང་ཁམས་ནི་གཉིས་ཏེ། འདུས་བྱས་ཀྱི་ཁམས་དང་། འདུས་མ་བྱས་ཀྱི་ཁམས་སོ། །
en: “Furthermore, there are two types of elements, compounded elements and uncompounded elements.

source: དེ་ལ་འདུས་བྱས་དང་འདུས་མ་བྱས་ཤེས་པ་ནི་ཁམས་ཤེས་པའོ། །
en: Knowing the compounded and uncompounded is knowledge of the elements.

source: གཞན་ཡང་མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ནི་ཆོས་ཀྱི་དབྱིངས་ཏེ། ཆོས་ཀྱི་དབྱིངས་ནི་ལྟ་བའི་ངོ་བོ་ཉིད་མ་ཡིན། རྫས་ཀྱི་ངོ་བོ་ཉིད་མ་ཡིན།
en: “Furthermore, the elements of the eye, form, and visual consciousness are the expanse of phenomena, but the expanse of phenomena is not the eye, material substance, or consciousness in essence.

source: རྣམ་པར་ཤེས་པའི་ངོ་བོ་ཉིད་མ་ཡིན་ནོ། །རྣ་བའི་ཁམས་དང་སྒྲའི་ཁམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་ནི་ཆོས་ཀྱི་དབྱིངས་ཏེ། ཆོས་ཀྱི་དབྱིངས་ནི་སྒྲ་འཛིན་པའི་ངོ་བོ་ཉིད་མ་ཡིན། སྒྲ་གཟུང་བའི་ངོ་བོ་ཉིད་མ་ཡིན།
en: The elements of the ear, sound, and ear consciousness are the expanse of phenomena, but the expanse of phenomena is not the subjective experience of sound, objective sound, or auditory consciousness in essence.

source: སྒྲ་རྣམ་པར་ཤེས་པའི་ངོ་བོ་ཉིད་མ་ཡིན་ནོ། །སྣའི་ཁམས་དང་དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་ནི་ཆོས་ཀྱི་དབྱིངས་ཏེ། ཆོས་ཀྱི་དབྱིངས་ནི་སྣོམ་པ་མ་ཡིན། བསྣམ་པ་མ་ཡིན།
en: The elements of the nose, smell, and olfactory consciousness are the expanse of phenomena, but the expanse of phenomena is not smelling, smell, or its consciousness.

source: རྣམ་པར་ཤེས་པ་མ་ཡིན་ནོ། །ལྕེའི་ཁམས་དང་རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་ནི་ཆོས་ཀྱི་དབྱིངས་ཏེ། ཆོས་ཀྱི་དབྱིངས་ནི་རོ་ལ་སྤྱོད་ཡུལ་པ་མ་ཡིན་རོ་བྲོ་བ་མ་ཡིན། ལྕེའི་རྣམ་པར་ཤེས་པས་ཐོབ་པ་མ་ཡིན་ནོ། །
en: The elements of the tongue, taste, and gustatory consciousness are the expanse of phenomena, but the expanse of phenomena is not within the domain of the tongue, it is not the experience of flavor, and it is not obtained through gustatory consciousness.

source: ལུས་ཀྱི་ཁམས་དང་རེག་བྱའི་ཁམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ནི་ཆོས་ཀྱི་དབྱིངས་ཏེ། ཆོས་ཀྱི་དབྱིངས་ནི་གོང་བུའི་མཚན་ཉིད་མ་ཡིན། རེག་པའི་མཚན་ཉིད་མ་ཡིན། སྨིག་རྒྱུའི་མཚན་ཉིད་མ་ཡིན་ནོ། །
en: The elements of the body, texture, and body consciousness are the expanse of phenomena, but the expanse of phenomena does not have the characteristics of mass, touch, or of being mirage-like.

source: ཡིད་ཀྱི་ཁམས་དང་ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ནི་ཆོས་ཀྱི་དབྱིངས་ཏེ། ཆོས་ཀྱི་དབྱིངས་ནི་སྐྱེ་བ་དང་། གནས་པ་དང་འཇིག་པའི་མཚན་ཉིད་མ་ཡིན་ཏེ།
en: The elements of mind, mental phenomena, and mental consciousness are the expanse of phenomena, but the expanse of phenomena does not have the characteristics of arising, persisting, or being destroyed.

source: གང་དེ་ལྟར་ཤེས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཁམས་ཤེས་པ་ཞེས་བྱའོ། །
en: That which is understood in this way is known as a bodhisattva’s knowledge of the elements.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་མཆེད་ཤེས་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s knowledge of the sense bases?

source: སྐྱེ་མཆེད་རྣམས་ལ་རྒྱ་ཆེ་བར་ཤེས་པ་དང་། ཟད་པར་ཤེས་པ་དང་། དཀའ་བར་ཤེས་པ་དང་། མདུད་པར་ཤེས་པ་དང་། ཟུག་རྔུར་ཤེས་པ་དང་། འཇིག་པར་ཤེས་པ་དང་། ཆུ་བོར་ཤེས་པ་དང་།
en: The sense bases are known to be extensive, all-encompassing, difficult, binding, painful, perishable, flowing, uniting, and fettering.

source: སྦྱོར་བར་ཤེས་པ་དང་། རྣམ་པར་འཆིང་བར་ཤེས་པ་ནི་སྐྱེ་མཆེད་ཤེས་པ་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་མཆེད་ཤེས་པ་ཞེས་བྱའོ། །
en: This knowledge of the sense bases is known as a bodhisattva’s knowledge of the sense bases.

source: གཞན་ཡང་གང་སྐྱེ་མཆེད་རྣམས་ལ་གྲོང་སྟོང་དུ་ཤེས་པ་སྟེ།
en: “Furthermore, the sense bases are known as an empty village.

source: དཔེར་ན་གྲོང་སྟོང་པ་བདག་ཉིད་ཀྱིས་བདག་ནི་གྲོང་སྟོང་པའོ་སྙམ་དུ་མི་ཤེས་པ་དེ་བཞིན་དུ།
en: An empty village, analogously, does not itself think, ‘I am an empty village.’

source: སྐྱེ་མཆེད་དེ་དག་ཀྱང་བདག་ཉིད་ཀྱིས་བདག་ཅག་ནི་གྲོང་སྟོང་པའོ་སྙམ་དུ་མི་ཤེས་ཏེ།
en: In the same way, the sense bases do not themselves think, ‘We are sense bases.’

source: གང་འདི་དག་དེ་ལྟར་ཤེས་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་མཆེད་ཤེས་པ་ཞེས་བྱའོ། །གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདི་སྙམ་དུ་སེམས་ཏེ།
en: To understand in this way is known as a bodhisattva’s knowledge of the sense bases.

source: སྐྱེ་མཆེད་བཅུ་གཉིས་ནི་མིག་གི་སྐྱེ་མཆེད་དང་། གཟུགས་ཀྱི་སྐྱེ་མཆེད་དང་། རྣ་བའི་སྐྱེ་མཆེད་དང་། སྒྲའི་སྐྱེ་མཆེད་དང་། སྣའི་སྐྱེ་མཆེད་དང་། དྲིའི་སྐྱེ་མཆེད་དང་། ལྕེའི་སྐྱེ་མཆེད་དང་། རོའི་སྐྱེ་མཆེད་དང་།
en: “Furthermore, a bodhisattva thinks, ‘The twelve sense bases—the sense bases of the eye and form, the ear and sound, the nose and smell, the tongue and taste, the body and texture, and the mind and mental phenomena—are all nothing more than that.

source: ལུས་ཀྱི་སྐྱེ་མཆེད་དང་། རེག་བྱའི་སྐྱེ་མཆེད་དང་། ཡིད་ཀྱི་སྐྱེ་མཆེད་དང་། ཆོས་ཀྱི་སྐྱེ་མཆེད་དེ་འདི་དག་ཐམས་ཅད་ནི་དེ་ཙམ་དུ་ཟད་དེ། འདི་ལ་བདག་དང་བདག་གི་ཞེས་བྱ་བ་མེད་དོ་སྙམ་མོ། །
en: They do not have notions of “I” and “mine.” ’

source: གང་དེ་ལྟར་ཤེས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་མཆེད་ཤེས་པ་ཞེས་བྱའོ། །
en: To understand in this way is known as a bodhisattva’s knowledge of the sense bases.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་འདས་པ་དང་མ་འོངས་པའི་ཤེས་པ་གང་ཞེ་ན།
en: “What is a bodhisattva’s knowledge of the past and future?

source: གང་འདས་པ་ལ་འགྲོ་བ་མེད་པར་ཤེས་པ་དང་།
en: It is knowing that nothing has departed in the past and nothing will come in the future.

source: མ་འོངས་པ་ལ་འོང་བ་མེད་པར་ཤེས་པ་འདི་ནི་འདས་པ་དང་མ་འོངས་པ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is known as knowledge of the past and future.

source: གཞན་ཡང་འདས་པ་ལ་ཟད་པར་ཤེས་པ་དང་།
en: Additionally, the bodhisattva knows that the past is gone and nothing will be created in the future.

source: མ་འོངས་པ་ལ་བྱེད་པ་མེད་པར་ཤེས་པ་འདི་ནི་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་འདས་པ་དང་མ་འོངས་པ་ཤེས་པ་ཞེས་བྱའོ། །
en: This, child of good family, is a bodhisattva’s knowledge of the past and future.

source: དེ་ལ་ལམ་དང་འབྲས་བུ་ཤེས་པ་གང་ཞེ་ན།
en: “What is knowledge of the path and its result?

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་རྣམས་ཤེས་པ་འདི་ནི་ལམ་ཤེས་པ་ཞེས་བྱའོ། །
en: Knowledge of the six perfections is knowledge of the path.

source: གང་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་ས་ཤེས་པ་འདི་ནི་འབྲས་བུ་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: Knowing the ten bodhisattva levels and the level of a thus-gone one is knowledge of the result.

source: གང་འདི་ཤེས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་དང་འབྲས་བུ་ཤེས་པ་ཞེས་བྱའོ། །
en: Knowing all this is a bodhisattva’s knowledge of the path and its result.

source: རིགས་ཀྱི་བུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་པ་བཅུ་སྟེ།
en: “Child of good family, these are the ten types of knowledge of bodhisattvas.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུ་པོ་དེ་དག་གིས་ཟག་པ་མེད་པའི་དགེ་བ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ཐོབ་པའི་དབང་བ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: “Child of good family, bodhisattvas should understand the force of attaining the ripening of the undefiled virtues through these ten approaches to the way of the Dharma.”

source: ཆོས་ཡང་དག་པར་བརྗོད་པ་འདི་ཡང་དག་པར་བརྗོད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་སྔོན་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་སྟོང་ཕྲག་བདུན་ཅུ་རྩ་དྲུག་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: Once this pronouncement of the Dharma had been made, the seventy-six thousand bodhisattvas with prior training attained acceptance of the nonarising of phenomena.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྣམ་པར་གནོན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་རབ་ཏུ་ལྡན་པའི་ཆོས་ཡང་དག་པར་བརྗོད་པ་སྤོབས་པར་གྱིས་ཤིག །
en: The bodhisattva Mativikrama then addressed the bodhisattva Nirārambha: “Child of good family, please eloquently describe the Dharma of the bodhisattvas that involves the perfections.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པའི་གཏམ་འདི་ནི་ཡང་དག་ཕུལ་གྱི་གཏམ་མོ། །
en: Child of good family, an account of the perfections is the most eminent kind of account.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ནི་གང་།
en: Thus, child of good family, what are the perfections?

source: དེ་དག་ཡང་དག་པར་བརྗོད་པ་ནི་གང་། དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྩོམ་པ་མེད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྣམ་པར་གནོན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: How are they described?”

source: རིགས་ཀྱི་བུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཐབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: The bodhisattva Nirārambha responded to the bodhisattva Mativikrama, “Child of good family, the perfections are the perfection of generosity, the perfection of discipline, the perfection of patience, the perfection of diligence, the perfection of meditative stability, the perfection of insight, the perfection of skillful means, the perfection of aspiration, the perfection of strength, and the perfection of wisdom.

source: སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། རིགས་ཀྱི་བུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་འདི་དག་གོ། །
en: Child of good family, these are the perfections.

source: དེ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་དག་ཡང་དག་པར་བརྗོད་པ་ནི་འདི་ལྟ་སྟེ།
en: “These perfections can be described as follows.

source: སྦྱིན་པའི་རློམ་སེམས་མེད་པས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། རྒྱུན་མི་འཆད་པར་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བར་མི་བྱེད་པ་ཡང་མ་ཡིན་ནོ། །
en: Generosity without conceit is the perfection of generosity; the failure to continuously give away all wealth is not.

source: ཚུལ་ཁྲིམས་ཀྱི་རློམ་སེམས་མེད་པས་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། ཚུལ་ཁྲིམས་དང་བསླབ་པ་དང་སྦྱངས་པའི་ཡོན་ཏན་དང་། ཡོ་བྱད་བསྙུངས་པ་ཐམས་ཅད་ལ་མི་འཇུག་པ་ཡང་མ་ཡིན་ནོ། །
en: Discipline without conceit is the perfection of discipline; the failure to take up all aspects of discipline, training, and the austere practices, and the failure to reduce one’s possessions, is not.

source: བཟོད་པའི་རློམ་སེམས་མེད་པས་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། རྟག་ཏུ་བཟོད་པ་དང་དེས་པ་ལ་ཡང་མི་འཇུག་པ་མ་ཡིན་ནོ། །
en: Patience without conceit is the perfection of patience; the failure to remain patient and gentle is not.

source: བརྩོན་འགྲུས་ཀྱི་རློམ་སེམས་མེད་པས་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། རྒྱུན་མི་འཆད་པར་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡང་དག་པར་མི་སྒྲུབ་པ་ཡང་མ་ཡིན་ནོ། །
en: Diligence without conceit is the perfection of diligence; the failure to constantly perfect all roots of virtue is not.

source: བསམ་གཏན་གྱི་རློམ་སེམས་མེད་པས་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། རྟག་ཏུ་ངེས་པར་སེམས་པ་ལྷུར་མི་ལེན་པ་ཡང་མ་ཡིན་ནོ། །
en: Meditative stability without conceit is the perfection of meditative stability; being continuously irresolute is not.

source: ཤེས་རབ་ཀྱི་རློམ་སེམས་མེད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། རྟག་ཏུ་ཐོས་པ་ཚོལ་བ་ལ་མངོན་པར་མི་བརྩོན་པ་ཡང་མ་ཡིན་ནོ། །
en: Insight without conceit is the perfection of insight; failure to be energetic in the quest for learning is not.

source: ཐབས་ཀྱི་རློམ་སེམས་མེད་པས་ཐབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། མུ་སྟེགས་ཅན་གྱི་གནས་ཐམས་ཅད་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་བྱ་བའི་རྩོམ་པ་རྣམས་ནི་མི་སྣང་བ་ཡང་མ་ཡིན་ནོ། །
en: Skillful means without conceit is the perfection of skillful means; failure to appear among both rival communities and those beings who seek to cultivate the roots of virtue is not.

source: སྨོན་ལམ་གྱི་རློམ་སེམས་མེད་པས་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་དང་། བདག་གི་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་ཀྱི་སྒོ་རྣམས་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་མི་བསྔོ་བ་ཡང་མ་ཡིན་ནོ། །
en: Aspirations made without conceit is the perfection of aspiration; to share access to the various roots of virtue of oneself and all beings, and then to not dedicate it to unsurpassable, completely perfect awakening, is not.

source: སྟོབས་ཀྱི་རློམ་སེམས་མེད་པས་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། སྲེད་མེད་ཀྱི་བུ་དང་ལག་ན་རྡོ་རྗེའི་གཟུགས་རྣམས་ཀྱིས་ང་རྒྱལ་དང་རྒྱགས་པ་དང་། དྲེགས་པས་ཁེངས་པའི་སེམས་ཅན་རྣམས་མི་འདུལ་བ་ཡང་མ་ཡིན་ནོ། །
en: Strength without conceit is the perfection of strength; the failure of those with the forms of Nārāyaṇa and Vajrapāṇi to tame beings who are puffed up with pride, arrogance, and haughtiness is not.

source: ཡེ་ཤེས་ཀྱི་རློམ་སེམས་མེད་པས་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། བཟོའི་གནས་དང་། སྦྱོར་བའི་གནས་དང་། ལས་ཀྱི་གནས་ཐམས་ཅད་ལ་མི་འཇུག་པ་ཡང་མ་ཡིན་ཏེ།
en: Wisdom without conceit is the perfection of wisdom; the failure to engage in any arts, expertise, or profession is not.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་རབ་ཏུ་ལྡན་པའི་ཆོས་ཡང་དག་པར་བརྗོད་པའོ། །
en: Child of good family, this describes the Dharma of the bodhisattvas that involves the perfections.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་རྣམ་པར་སྨིན་པ་ལ་ཡང་རེ་བ་མེད་ལ། རྣམ་པ་ཐམས་ཅད་ཀྱིས་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་ཕྱིར་ཡང་བརྩོན་པ་དང་།
en: “Furthermore, child of good family, bodhisattvas also do not hope for any result, and yet strive to give away all material goods in every way.

source: ཚུལ་ཁྲིམས་ལ་ཡང་རྣམ་པར་མི་རྟོག་ལ་སྲོག་གི་ཕྱིར་ཡང་བསླབ་པ་མི་འདྲལ་བ་དང་།
en: They form no concepts about discipline, and yet will not violate their training even at the cost of their life.

source: མི་འཁྲུགས་པའི་ཆོས་ཉིད་ཀྱང་ཡིན་ལ་གནོད་སེམས་ཀྱི་ཐ་བ་དང་ཞེ་སྡང་ཡང་མི་སྐྱེད་པ་དང་།
en: They are fundamentally unshakeable, and yet they loathe maliciousness even while not getting angry.

source: འདོད་པ་ཡང་མེད་ལ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱང་རྩོམ་པ་དང་།
en: They have no desire, and yet they strive for all roots of virtue.

source: རྣམ་པར་རྟོག་པ་ཡང་མེད་ལ་བསམ་གཏན་དང་མངོན་པར་ཤེས་པ་ཡང་ཀུན་ཏུ་ཚོལ་བ་དང་།
en: They are nonconceptual, and yet are dedicated to meditative stability and the higher cognitions.

source: ཆོས་ཐམས་ཅད་ལ་ཐེ་ཙོམ་ཡང་མེད་ལ་ཐོས་པ་དང་བསམ་པ་དང་། བསྒོམ་པའི་སྦྱོར་བ་ཡང་ཀུན་ཏུ་ཚོལ་བ་དང་།
en: They have absolutely no doubts about anything, and yet dedicatedly apply themselves to study, reflection, and meditation.

source: ཆོས་ཐམས་ཅད་དོན་དུ་གཉེར་བ་ཡང་མེད་ལ། དགེ་བའི་རྩ་བ་སྣ་ཚོགས་ཐམས་ཅད་ལ་ཡང་དམིགས་པ་དང་།
en: They do not seek anything at all, and yet apprehend all the various roots of virtue.

source: སེམས་གང་ལ་ཡང་མི་གནས་ལ་སྨོན་ལམ་ཐམས་ཅད་ཀྱང་མངོན་པར་བསྒྲུབ་པ་དང་།
en: Their minds remain nowhere, and yet all their aspirations are accomplished.

source: ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་ཡང་བཅོམ་ལ་སྲ་བ་རྡོ་རྗེ་ལྟར་མི་ཕྱེད་པའི་ལུས་ཀྱང་སྒྲུབ་པ་དང་།
en: They have defeated pride, arrogance, and haughtiness, and yet they have attained an unbreakable body that is hard like a diamond.

source: བསྟན་བཅོས་ཐམས་ཅད་ཀྱང་ཤེས་པ་སློབ་དཔོན་དང་བླ་མ་ཐམས་ཅད་ཀྱང་ཀུན་ཏུ་ཚོལ་བ་འདི་ནི་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་རབ་ཏུ་ལྡན་པའི་ཆོས་ཡང་དག་པར་བརྗོད་པའོ། །
en: They know all treatises, and yet they seek out teachers and masters. This, child of good family, describes the Dharma of the bodhisattvas that involves the perfections.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་སྦྱིན་པ་ལ་ཡང་དགའ་ལ་སེམས་ཅན་སེར་སྣ་ཅན་དང་འཐུན་པར་ཡང་འཇུག་པ་དང་ཚུལ་ཁྲིམས་ལ་ཡང་དགའ་ལ་སེམས་ཅན་ཚུལ་ཁྲིམས་འཆལ་པ་དང་འཐུན་པར་ཡང་འཇུག་པ་དང་།
en: “Furthermore, child of good family, bodhisattvas delight in generosity while engaging harmoniously with stingy beings. They delight in discipline while engaging harmoniously with beings who have poor discipline.

source: བཟོད་པ་ལ་ཡང་དགའ་ལ་སེམས་ཅན་གནོད་སེམས་ཅན་སེམས་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་དང་འཐུན་པར་ཡང་འཇུག་པ་དང་།
en: They delight in patience while engaging harmoniously with beings whose minds have been corrupted by maliciousness.

source: བརྩོན་འགྲུས་ལ་ཡང་དགའ་ལ་སེམས་ཅན་ལེ་ལོ་ཅན་བརྩོན་འགྲུས་ཆུང་བ་བརྩོན་འགྲུས་ཉམས་པ་དང་འཐུན་པར་ཡང་འཇུག་པ་དང་།
en: They delight in diligence while engaging harmoniously with beings who are lazy and who have little or no diligence.

source: བསམ་གཏན་ལ་ཡང་དགའ་ལ་སེམས་ཅན་བྱ་བ་མང་པོས་གཡེངས་པ་སེམས་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་དང་འཐུན་པར་ཡང་འཇུག་པ་དང་།
en: They delight in meditative stability while engaging harmoniously with beings whose minds have been corrupted by the distractions of many activities.

source: ཤེས་རབ་ལ་ཡང་དགའ་ལ་སེམས་ཅན་བླུན་པ་ལུག་ལྟར་ལྐུགས་པའི་རང་བཞིན་ཅན་རྟག་ཏུ་མ་དད་པ་དང་འཐུན་པར་འཇུག་པ་དང་།
en: They delight in insight while engaging harmoniously with dimwitted beings who are innately dull like sheep and who are always faithless.

source: ཐབས་ལ་ཡང་དགའ་ལ་བྱ་བ་ཐམས་ཅད་ཀྱང་དོན་དུ་མི་གཉེར་བ་དང་།
en: They delight in skillful means while not getting involved in any activity at all.

source: སྨོན་ལམ་ལ་ཡང་དགའ་ལ་སེམས་ཅན་འཁོར་བས་མུས་བྱུང་བ་དང་འཐུན་པར་འཇུག་པ་དང་།
en: They delight in aspirations while engaging harmoniously with beings who are depressed by saṃsāra.

source: སྟོབས་ལ་ཡང་དགའ་ལ་སེམས་ཅན་ཉམ་ཆུང་བ་མཐུ་མེད་པ་དང་འཐུན་པར་ཡང་འཇུག་པ་དང་།
en: They delight in strength while engaging harmoniously with beings who are weak and powerless.

source: ཡེ་ཤེས་ལ་ཡང་དགའ་ལ་སེམས་ཅན་འཁོར་བ་ལ་མངོན་པར་དགའ་བ་དང་འཐུན་པར་ཡང་འཇུག་པ་འདི་ནི་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་རབ་ཏུ་ལྡན་པའི་ཆོས་ཡང་དག་པར་བརྗོད་པའོ། །
en: They delight in wisdom while engaging harmoniously with those beings who find joy in saṃsāra. This, child of good family, describes the Dharma of the bodhisattvas that involves the perfections.

source: གཞན་ཡང་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ནི་ལག་ན་རིན་པོ་ཆེ་དང་། ནམ་མཁའི་མཛོད་འཐོབ་བོ། །
en: “Furthermore, child of good family, bodhisattvas attain the jewel-in-hand and the sky treasury through the perfection of generosity.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ནི་ངན་སོང་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདའ་བ་དང་། འཆི་འཕོ་དང་སྐྱེ་བ་ལ་དབང་བ་དང་ཅང་ཤེས་པའི་སེམས་འཐོབ་བོ། །
en: They transcend lower states of rebirth, gain power over transmigration and birth, and attain a noble mind through the perfection of discipline.

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ནི་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཚན་དང་དཔེ་བྱད་བཟང་པོས་ལེགས་པར་བརྒྱན་པ། བལྟ་བས་མི་ངོམས་པ་འཐོབ་བོ། །
en: They attain the body of a thus-gone one—well-adorned with the major and minor marks and impossible to look away from—through the perfection of patience.
